#Завдання 1. Числа, кратні 3 або 5 — 2 б.
#Користувач вводить натуральне число N. Для чисел від 1 до N знайдіть суму, кількість і середнє
#арифметичне тих чисел, які кратні 3 або 5.
#Вимога: використати цикл for. Якщо таких чисел немає, не виконувати ділення на нуль.

n = int(input("Введіть натуральне число: "))
suma = 0
k = 0
sru = 0
for i in range(1, n+1, 1):
    if i % 3 == 0 or i % 5 == 0:
        suma = suma+i
        k = k+1

if k !=0:
    sru = suma/k
print("Сума чисел кратних 3 або 5: ",suma)
print("Кількість чисел кратних 3 або 5: ",k)
print("Середнє арифметичне чисел кратних 3 або 5: ",sru)


#Завдання 2. Аналіз цифр натурального числа — 3 б.
#Користувач вводить натуральне число N. Без перетворення числа на рядок визначте кількість цифр, суму
#цифр, найбільшу та найменшу цифру.
#Вимога: використати while, // та %. Окремо продумати коректну обробку числа 0.

n = int(input("Введіть натуральне число: "))
suma = 0
k = 0
ost = 0
ost= n%10

min = ost
max = ost
if n == 0:
    k+=1
while n > 0:
    #print(n)
    ost = n % 10
    n = n // 10

    k+=1
    suma = suma + ost
    #print(n, ost)
    if ost >= max:
        max = ost
    if ost <= min:
        min = ost
print("Кількість цифр у числі: ", k)
print("Сума цифр у числі: ", suma)
print("Найбільша цифра у числі: ", max)
print("Найменша цифра у числі: ", min)

#Завдання 3. Числа, що діляться на власні цифри — 3 б.
#Користувач вводить натуральне число N. Знайдіть усі числа від 1 до N, які діляться без остачі на кожну
#свою ненульову цифру.
#Вимога: цифру 0 не використовувати як дільник. Цифри числа аналізувати арифметично, без
#перетворення на рядок.

n = int(input("Введіть натуральне число: "))
t = 0
ost = 0
for i in range(1, n + 1, 1):
    t = i
    isok=True
    while t > 0:
        ost = t % 10
        if ost == 0 or i % ost != 0:
            isok = False
            break

        t=t//10
    if isok:
        print(i, end=" ")

print()
#1 2 3 4 5 6 7 8 9 11 12 15 22 24

#Завдання 4. Рамка символами — 4 б.
#Користувач вводить ширину width, висоту height, символ контуру та символ внутрішньої частини.
#Побудуйте прямокутну рамку за допомогою вкладених циклів.
#Вимога: мінімальний розмір рамки — 3 × 3. Якщо width або height менше 3, вивести повідомлення про
#помилку.
width = int(input("Введіть ширину width: "))
height = int(input("Введіть висоту height: "))
if width <3 or height <3:
    print("Помилкові дані, мінімум 3х3")
for y in range(1, height+1, 1):
    if y==1 or y==height:
        for x in range(1, width+1, 1):
            print("#",end=" ")
    else:
        for x in range(1, width+1, 1):
            if x ==1 or x==width:
                print("#",end=" ")
            else:
                print(" ",end=" ")
    print()

